results/pohjavirta.ring-interceptors.java8.ParallelGC.r10k.t16.c400.d600s.out
Running 10m test @ http://localhost:9999/math/plus?x=1&y=2
  16 threads and 400 connections
  Thread calibration: mean lat.: 2.295ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 2.296ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.919ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.982ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.940ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 2.166ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 2.308ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 2.186ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.994ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 2.133ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 2.187ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 2.114ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 2.252ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.918ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 2.106ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 2.251ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     2.04ms    1.73ms  35.10ms   87.95%
    Req/Sec   659.21    363.85     2.44k    66.92%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.55ms
 75.000%    2.51ms
 90.000%    3.92ms
 99.000%    8.69ms
 99.900%   16.74ms
 99.990%   23.18ms
 99.999%   28.99ms
100.000%   35.13ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.082     0.000000            1         1.00
       0.650     0.100000       591040         1.11
       0.903     0.200000      1179783         1.25
       1.121     0.300000      1770726         1.43
       1.320     0.400000      2360477         1.67
       1.548     0.500000      2950021         2.00
       1.685     0.550000      3244317         2.22
       1.842     0.600000      3540781         2.50
       2.024     0.650000      3834595         2.86
       2.243     0.700000      4129806         3.33
       2.513     0.750000      4424511         4.00
       2.673     0.775000      4572744         4.44
       2.851     0.800000      4719238         5.00
       3.057     0.825000      4866907         5.71
       3.291     0.850000      5013966         6.67
       3.571     0.875000      5161473         8.00
       3.735     0.887500      5235399         8.89
       3.923     0.900000      5309519        10.00
       4.131     0.912500      5382658        11.43
       4.379     0.925000      5457020        13.33
       4.675     0.937500      5530558        16.00
       4.851     0.943750      5567575        17.78
       5.047     0.950000      5604161        20.00
       5.275     0.956250      5640959        22.86
       5.547     0.962500      5677894        26.67
       5.875     0.968750      5714570        32.00
       6.075     0.971875      5733124        35.56
       6.299     0.975000      5751430        40.00
       6.567     0.978125      5769762        45.71
       6.895     0.981250      5788169        53.33
       7.343     0.984375      5806688        64.00
       7.631     0.985938      5815820        71.11
       7.975     0.987500      5825038        80.00
       8.391     0.989062      5834288        91.43
       8.911     0.990625      5843540       106.67
       9.567     0.992188      5852674       128.00
       9.959     0.992969      5857352       142.22
      10.391     0.993750      5861906       160.00
      10.895     0.994531      5866562       182.86
      11.471     0.995313      5871115       213.33
      12.151     0.996094      5875749       256.00
      12.535     0.996484      5878033       284.44
      12.967     0.996875      5880343       320.00
      13.455     0.997266      5882645       365.71
      13.991     0.997656      5884940       426.67
      14.607     0.998047      5887265       512.00
      14.943     0.998242      5888390       568.89
      15.335     0.998437      5889558       640.00
      15.791     0.998633      5890708       731.43
      16.263     0.998828      5891849       853.33
      16.815     0.999023      5893024      1024.00
      17.135     0.999121      5893576      1137.78
      17.471     0.999219      5894167      1280.00
      17.855     0.999316      5894740      1462.86
      18.287     0.999414      5895309      1706.67
      18.831     0.999512      5895880      2048.00
      19.151     0.999561      5896169      2275.56
      19.503     0.999609      5896470      2560.00
      19.855     0.999658      5896743      2925.71
      20.239     0.999707      5897042      3413.33
      20.719     0.999756      5897318      4096.00
      21.071     0.999780      5897464      4551.11
      21.455     0.999805      5897611      5120.00
      21.791     0.999829      5897760      5851.43
      22.207     0.999854      5897894      6826.67
      22.671     0.999878      5898038      8192.00
      22.927     0.999890      5898109      9102.22
      23.247     0.999902      5898187     10240.00
      23.599     0.999915      5898256     11702.86
      23.951     0.999927      5898328     13653.33
      24.383     0.999939      5898397     16384.00
      24.671     0.999945      5898433     18204.44
      24.879     0.999951      5898471     20480.00
      25.247     0.999957      5898505     23405.71
      25.599     0.999963      5898542     27306.67
      26.191     0.999969      5898578     32768.00
      26.463     0.999973      5898597     36408.89
      26.687     0.999976      5898613     40960.00
      26.975     0.999979      5898632     46811.43
      27.407     0.999982      5898649     54613.33
      27.839     0.999985      5898668     65536.00
      28.127     0.999986      5898676     72817.78
      28.479     0.999988      5898686     81920.00
      28.927     0.999989      5898694     93622.86
      29.119     0.999991      5898703    109226.67
      29.631     0.999992      5898712    131072.00
      29.855     0.999993      5898717    145635.56
      30.047     0.999994      5898721    163840.00
      30.191     0.999995      5898726    187245.71
      30.463     0.999995      5898730    218453.33
      30.767     0.999996      5898735    262144.00
      30.895     0.999997      5898737    291271.11
      30.991     0.999997      5898740    327680.00
      31.247     0.999997      5898742    374491.43
      31.519     0.999998      5898744    436906.67
      31.935     0.999998      5898746    524288.00
      32.031     0.999998      5898747    582542.22
      32.143     0.999998      5898748    655360.00
      32.303     0.999999      5898750    748982.86
      32.431     0.999999      5898751    873813.33
      32.447     0.999999      5898752   1048576.00
      32.447     0.999999      5898752   1165084.44
      32.495     0.999999      5898753   1310720.00
      32.687     0.999999      5898754   1497965.71
      32.687     0.999999      5898754   1747626.67
      33.055     1.000000      5898755   2097152.00
      33.055     1.000000      5898755   2330168.89
      33.055     1.000000      5898755   2621440.00
      34.111     1.000000      5898756   2995931.43
      34.111     1.000000      5898756   3495253.33
      34.111     1.000000      5898756   4194304.00
      34.111     1.000000      5898756   4660337.78
      34.111     1.000000      5898756   5242880.00
      35.135     1.000000      5898757   5991862.86
      35.135     1.000000      5898757          inf
#[Mean    =        2.039, StdDeviation   =        1.726]
#[Max     =       35.104, Total count    =      5898757]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  5999568 requests in 10.00m, 0.86GB read
Requests/sec:   9999.26
Transfer/sec:      1.47MB